GopalSaraf/Practicals/PSDL/include/proc/pic16f1946.inc
// Register: FSR1H
#define FSR1H FSR1H
FSR1H                                    equ 0007h
// bitfield definitions
FSR1H_FSR1H_POSN                         equ 0000h
FSR1H_FSR1H_POSITION                     equ 0000h
FSR1H_FSR1H_SIZE                         equ 0008h
FSR1H_FSR1H_LENGTH                       equ 0008h
FSR1H_FSR1H_MASK                         equ 00FFh

// Register: BSR
#define BSR BSR
BSR                                      equ 0008h
// bitfield definitions
BSR_BSR0_POSN                            equ 0000h
BSR_BSR0_POSITION                        equ 0000h
BSR_BSR0_SIZE                            equ 0001h
BSR_BSR0_LENGTH                          equ 0001h
BSR_BSR0_MASK                            equ 0001h
BSR_BSR1_POSN                            equ 0001h
BSR_BSR1_POSITION                        equ 0001h
BSR_BSR1_SIZE                            equ 0001h
BSR_BSR1_LENGTH                          equ 0001h
BSR_BSR1_MASK                            equ 0002h
BSR_BSR2_POSN                            equ 0002h
BSR_BSR2_POSITION                        equ 0002h
BSR_BSR2_SIZE                            equ 0001h
BSR_BSR2_LENGTH                          equ 0001h
BSR_BSR2_MASK                            equ 0004h
BSR_BSR3_POSN                            equ 0003h
BSR_BSR3_POSITION                        equ 0003h
BSR_BSR3_SIZE                            equ 0001h
BSR_BSR3_LENGTH                          equ 0001h
BSR_BSR3_MASK                            equ 0008h
BSR_BSR4_POSN                            equ 0004h
BSR_BSR4_POSITION                        equ 0004h
BSR_BSR4_SIZE                            equ 0001h
BSR_BSR4_LENGTH                          equ 0001h
BSR_BSR4_MASK                            equ 0010h
BSR_BSR_POSN                             equ 0000h
BSR_BSR_POSITION                         equ 0000h
BSR_BSR_SIZE                             equ 0005h
BSR_BSR_LENGTH                           equ 0005h
BSR_BSR_MASK                             equ 001Fh

// Register: WREG
#define WREG WREG
WREG                                     equ 0009h
// bitfield definitions
WREG_WREG0_POSN                          equ 0000h
WREG_WREG0_POSITION                      equ 0000h
WREG_WREG0_SIZE                          equ 0008h
WREG_WREG0_LENGTH                        equ 0008h
WREG_WREG0_MASK                          equ 00FFh

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 000Ah
// bitfield definitions
PCLATH_PCLATH_POSN                       equ 0000h
PCLATH_PCLATH_POSITION                   equ 0000h
PCLATH_PCLATH_SIZE                       equ 0007h
PCLATH_PCLATH_LENGTH                     equ 0007h
PCLATH_PCLATH_MASK                       equ 007Fh

// Register: INTCON
#define INTCON INTCON
INTCON                                   equ 000Bh
// bitfield definitions
INTCON_IOCIF_POSN                        equ 0000h
INTCON_IOCIF_POSITION                    equ 0000h
INTCON_IOCIF_SIZE                        equ 0001h
INTCON_IOCIF_LENGTH                      equ 0001h
INTCON_IOCIF_MASK                        equ 0001h
INTCON_INTF_POSN                         equ 0001h
INTCON_INTF_POSITION                     equ 0001h
INTCON_INTF_SIZE                         equ 0001h
INTCON_INTF_LENGTH                       equ 0001h
INTCON_INTF_MASK                         equ 0002h
INTCON_TMR0IF_POSN                       equ 0002h
INTCON_TMR0IF_POSITION                   equ 0002h
INTCON_TMR0IF_SIZE                       equ 0001h
INTCON_TMR0IF_LENGTH                     equ 0001h
INTCON_TMR0IF_MASK                       equ 0004h
INTCON_IOCIE_POSN                        equ 0003h
INTCON_IOCIE_POSITION                    equ 0003h
INTCON_IOCIE_SIZE                        equ 0001h
INTCON_IOCIE_LENGTH                      equ 0001h
INTCON_IOCIE_MASK                        equ 0008h
INTCON_INTE_POSN                         equ 0004h
INTCON_INTE_POSITION                     equ 0004h
INTCON_INTE_SIZE                         equ 0001h
INTCON_INTE_LENGTH                       equ 0001h
INTCON_INTE_MASK                         equ 0010h
INTCON_TMR0IE_POSN                       equ 0005h
INTCON_TMR0IE_POSITION                   equ 0005h
INTCON_TMR0IE_SIZE                       equ 0001h
INTCON_TMR0IE_LENGTH                     equ 0001h
INTCON_TMR0IE_MASK                       equ 0020h
INTCON_PEIE_POSN                         equ 0006h
INTCON_PEIE_POSITION                     equ 0006h
INTCON_PEIE_SIZE                         equ 0001h
INTCON_PEIE_LENGTH                       equ 0001h
INTCON_PEIE_MASK                         equ 0040h
INTCON_GIE_POSN                          equ 0007h
INTCON_GIE_POSITION                      equ 0007h
INTCON_GIE_SIZE                          equ 0001h
INTCON_GIE_LENGTH                        equ 0001h
INTCON_GIE_MASK                          equ 0080h
INTCON_T0IF_POSN                         equ 0002h
INTCON_T0IF_POSITION                     equ 0002h
INTCON_T0IF_SIZE                         equ 0001h
INTCON_T0IF_LENGTH                       equ 0001h
INTCON_T0IF_MASK                         equ 0004h
INTCON_T0IE_POSN                         equ 0005h
INTCON_T0IE_POSITION                     equ 0005h
INTCON_T0IE_SIZE                         equ 0001h
INTCON_T0IE_LENGTH                       equ 0001h
INTCON_T0IE_MASK                         equ 0020h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 000Ch
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h
PORTA_RA6_POSN                           equ 0006h
PORTA_RA6_POSITION                       equ 0006h
PORTA_RA6_SIZE                           equ 0001h
PORTA_RA6_LENGTH                         equ 0001h
PORTA_RA6_MASK                           equ 0040h
PORTA_RA7_POSN                           equ 0007h
PORTA_RA7_POSITION                       equ 0007h
PORTA_RA7_SIZE                           equ 0001h
PORTA_RA7_LENGTH                         equ 0001h
PORTA_RA7_MASK                           equ 0080h
PORTA_AN0_POSN                           equ 0000h
PORTA_AN0_POSITION                       equ 0000h
PORTA_AN0_SIZE                           equ 0001h
PORTA_AN0_LENGTH                         equ 0001h
PORTA_AN0_MASK                           equ 0001h
PORTA_AN1_POSN                           equ 0001h
PORTA_AN1_POSITION                       equ 0001h
PORTA_AN1_SIZE                           equ 0001h
PORTA_AN1_LENGTH                         equ 0001h
PORTA_AN1_MASK                           equ 0002h
PORTA_AN2_POSN                           equ 0002h
PORTA_AN2_POSITION                       equ 0002h
PORTA_AN2_SIZE                           equ 0001h
PORTA_AN2_LENGTH                         equ 0001h
PORTA_AN2_MASK                           equ 0004h
PORTA_AN3_POSN                           equ 0003h
PORTA_AN3_POSITION                       equ 0003h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0008h
PORTA_AN4_POSN                           equ 0005h
PORTA_AN4_POSITION                       equ 0005h
PORTA_AN4_SIZE                           equ 0001h
PORTA_AN4_LENGTH                         equ 0001h
PORTA_AN4_MASK                           equ 0020h
PORTA_CPS0_POSN                          equ 0000h
PORTA_CPS0_POSITION                      equ 0000h
PORTA_CPS0_SIZE                          equ 0001h
PORTA_CPS0_LENGTH                        equ 0001h
PORTA_CPS0_MASK                          equ 0001h
PORTA_CPS1_POSN                          equ 0001h
PORTA_CPS1_POSITION                      equ 0001h
PORTA_CPS1_SIZE                          equ 0001h
PORTA_CPS1_LENGTH                        equ 0001h
PORTA_CPS1_MASK                          equ 0002h
PORTA_CPS2_POSN                          equ 0002h
PORTA_CPS2_POSITION                      equ 0002h
PORTA_CPS2_SIZE                          equ 0001h
PORTA_CPS2_LENGTH                        equ 0001h
PORTA_CPS2_MASK                          equ 0004h
PORTA_CPS3_POSN                          equ 0003h
PORTA_CPS3_POSITION                      equ 0003h
PORTA_CPS3_SIZE                          equ 0001h
PORTA_CPS3_LENGTH                        equ 0001h
PORTA_CPS3_MASK                          equ 0008h
PORTA_CPS4_POSN                          equ 0005h
PORTA_CPS4_POSITION                      equ 0005h
PORTA_CPS4_SIZE                          equ 0001h
PORTA_CPS4_LENGTH                        equ 0001h
PORTA_CPS4_MASK                          equ 0020h
PORTA_SEG33_POSN                         equ 0000h
PORTA_SEG33_POSITION                     equ 0000h
PORTA_SEG33_SIZE                         equ 0001h
PORTA_SEG33_LENGTH                       equ 0001h
PORTA_SEG33_MASK                         equ 0001h
PORTA_SEG18_POSN                         equ 0001h
PORTA_SEG18_POSITION                     equ 0001h
PORTA_SEG18_SIZE                         equ 0001h
PORTA_SEG18_LENGTH                       equ 0001h
PORTA_SEG18_MASK                         equ 0002h
PORTA_SEG34_POSN                         equ 0002h
PORTA_SEG34_POSITION                     equ 0002h
PORTA_SEG34_SIZE                         equ 0001h
PORTA_SEG34_LENGTH                       equ 0001h
PORTA_SEG34_MASK                         equ 0004h
PORTA_SEG35_POSN                         equ 0003h
PORTA_SEG35_POSITION                     equ 0003h
PORTA_SEG35_SIZE                         equ 0001h
PORTA_SEG35_LENGTH                       equ 0001h
PORTA_SEG35_MASK                         equ 0008h
PORTA_SEG14_POSN                         equ 0004h
PORTA_SEG14_POSITION                     equ 0004h
PORTA_SEG14_SIZE                         equ 0001h
PORTA_SEG14_LENGTH                       equ 0001h
PORTA_SEG14_MASK                         equ 0010h
PORTA_SEG15_POSN                         equ 0005h
PORTA_SEG15_POSITION                     equ 0005h
PORTA_SEG15_SIZE                         equ 0001h
PORTA_SEG15_LENGTH                       equ 0001h
PORTA_SEG15_MASK                         equ 0020h
PORTA_SEG36_POSN                         equ 0006h
PORTA_SEG36_POSITION                     equ 0006h
PORTA_SEG36_SIZE                         equ 0001h
PORTA_SEG36_LENGTH                       equ 0001h
PORTA_SEG36_MASK                         equ 0040h
PORTA_SEG37_POSN                         equ 0007h
PORTA_SEG37_POSITION                     equ 0007h
PORTA_SEG37_SIZE                         equ 0001h
PORTA_SEG37_LENGTH                       equ 0001h
PORTA_SEG37_MASK                         equ 0080h
PORTA_VREFM_POSN                         equ 0002h
PORTA_VREFM_POSITION                     equ 0002h
PORTA_VREFM_SIZE                         equ 0001h
PORTA_VREFM_LENGTH                       equ 0001h
PORTA_VREFM_MASK                         equ 0004h
PORTA_VREFP_POSN                         equ 0003h
PORTA_VREFP_POSITION                     equ 0003h
PORTA_VREFP_SIZE                         equ 0001h
PORTA_VREFP_LENGTH                       equ 0001h
PORTA_VREFP_MASK                         equ 0008h
PORTA_T0CKI_POSN                         equ 0004h
PORTA_T0CKI_POSITION                     equ 0004h
PORTA_T0CKI_SIZE                         equ 0001h
PORTA_T0CKI_LENGTH                       equ 0001h
PORTA_T0CKI_MASK                         equ 0010h
PORTA_OSC2_POSN                          equ 0006h
PORTA_OSC2_POSITION                      equ 0006h
PORTA_OSC2_SIZE                          equ 0001h
PORTA_OSC2_LENGTH                        equ 0001h
PORTA_OSC2_MASK                          equ 0040h
PORTA_OSC1_POSN                          equ 0007h
PORTA_OSC1_POSITION                      equ 0007h
PORTA_OSC1_SIZE                          equ 0001h
PORTA_OSC1_LENGTH                        equ 0001h
PORTA_OSC1_MASK                          equ 0080h
PORTA_CLKOUT_POSN                        equ 0006h
PORTA_CLKOUT_POSITION                    equ 0006h
PORTA_CLKOUT_SIZE                        equ 0001h
PORTA_CLKOUT_LENGTH                      equ 0001h
PORTA_CLKOUT_MASK                        equ 0040h
PORTA_CLKIN_POSN                         equ 0007h
PORTA_CLKIN_POSITION                     equ 0007h
PORTA_CLKIN_SIZE                         equ 0001h
PORTA_CLKIN_LENGTH                       equ 0001h
PORTA_CLKIN_MASK                         equ 0080h

// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 000Dh
// bitfield definitions
PORTB_RB0_POSN                           equ 0000h
PORTB_RB0_POSITION                       equ 0000h
PORTB_RB0_SIZE                           equ 0001h
PORTB_RB0_LENGTH                         equ 0001h
PORTB_RB0_MASK                           equ 0001h
PORTB_RB1_POSN                           equ 0001h
PORTB_RB1_POSITION                       equ 0001h
PORTB_RB1_SIZE                           equ 0001h
PORTB_RB1_LENGTH                         equ 0001h
PORTB_RB1_MASK                           equ 0002h
PORTB_RB2_POSN                           equ 0002h
PORTB_RB2_POSITION                       equ 0002h
PORTB_RB2_SIZE                           equ 0001h
PORTB_RB2_LENGTH                         equ 0001h
PORTB_RB2_MASK                           equ 0004h
PORTB_RB3_POSN                           equ 0003h
PORTB_RB3_POSITION                       equ 0003h
PORTB_RB3_SIZE                           equ 0001h
PORTB_RB3_LENGTH                         equ 0001h
PORTB_RB3_MASK                           equ 0008h
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h
PORTB_SEG30_POSN                         equ 0000h
PORTB_SEG30_POSITION                     equ 0000h
PORTB_SEG30_SIZE                         equ 0001h
PORTB_SEG30_LENGTH                       equ 0001h
PORTB_SEG30_MASK                         equ 0001h
PORTB_SEG8_POSN                          equ 0001h
PORTB_SEG8_POSITION                      equ 0001h
PORTB_SEG8_SIZE                          equ 0001h
PORTB_SEG8_LENGTH                        equ 0001h
PORTB_SEG8_MASK                          equ 0002h
PORTB_SEG9_POSN                          equ 0002h
PORTB_SEG9_POSITION                      equ 0002h
PORTB_SEG9_SIZE                          equ 0001h
PORTB_SEG9_LENGTH                        equ 0001h
PORTB_SEG9_MASK                          equ 0004h
PORTB_SEG10_POSN                         equ 0003h
PORTB_SEG10_POSITION                     equ 0003h
PORTB_SEG10_SIZE                         equ 0001h
PORTB_SEG10_LENGTH                       equ 0001h
PORTB_SEG10_MASK                         equ 0008h
PORTB_SEG11_POSN                         equ 0004h
PORTB_SEG11_POSITION                     equ 0004h
PORTB_SEG11_SIZE                         equ 0001h
PORTB_SEG11_LENGTH                       equ 0001h
PORTB_SEG11_MASK                         equ 0010h
PORTB_SEG29_POSN                         equ 0005h
PORTB_SEG29_POSITION                     equ 0005h
PORTB_SEG29_SIZE                         equ 0001h
PORTB_SEG29_LENGTH                       equ 0001h
PORTB_SEG29_MASK                         equ 0020h
PORTB_SEG38_POSN                         equ 0006h
PORTB_SEG38_POSITION                     equ 0006h
PORTB_SEG38_SIZE                         equ 0001h
PORTB_SEG38_LENGTH                       equ 0001h
PORTB_SEG38_MASK                         equ 0040h
PORTB_SEG39_POSN                         equ 0007h
PORTB_SEG39_POSITION                     equ 0007h
PORTB_SEG39_SIZE                         equ 0001h
PORTB_SEG39_LENGTH                       equ 0001h
PORTB_SEG39_MASK                         equ 0080h
PORTB_SRI_POSN                           equ 0000h
PORTB_SRI_POSITION                       equ 0000h
PORTB_SRI_SIZE                           equ 0001h
PORTB_SRI_LENGTH                         equ 0001h
PORTB_SRI_MASK                           equ 0001h
PORTB_T1G_POSN                           equ 0005h
PORTB_T1G_POSITION                       equ 0005h
PORTB_T1G_SIZE                           equ 0001h
PORTB_T1G_LENGTH                         equ 0001h
PORTB_T1G_MASK                           equ 0020h
PORTB_FLT0_POSN                          equ 0000h
PORTB_FLT0_POSITION                      equ 0000h
PORTB_FLT0_SIZE                          equ 0001h
PORTB_FLT0_LENGTH                        equ 0001h
PORTB_FLT0_MASK                          equ 0001h

