GopalSaraf/Practicals/PSDL/include/proc/pic16f1946.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 000Fh
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h
PORTD_SEG0_POSN                          equ 0000h
PORTD_SEG0_POSITION                      equ 0000h
PORTD_SEG0_SIZE                          equ 0001h
PORTD_SEG0_LENGTH                        equ 0001h
PORTD_SEG0_MASK                          equ 0001h
PORTD_SEG1_POSN                          equ 0001h
PORTD_SEG1_POSITION                      equ 0001h
PORTD_SEG1_SIZE                          equ 0001h
PORTD_SEG1_LENGTH                        equ 0001h
PORTD_SEG1_MASK                          equ 0002h
PORTD_SEG2_POSN                          equ 0002h
PORTD_SEG2_POSITION                      equ 0002h
PORTD_SEG2_SIZE                          equ 0001h
PORTD_SEG2_LENGTH                        equ 0001h
PORTD_SEG2_MASK                          equ 0004h
PORTD_SEG3_POSN                          equ 0003h
PORTD_SEG3_POSITION                      equ 0003h
PORTD_SEG3_SIZE                          equ 0001h
PORTD_SEG3_LENGTH                        equ 0001h
PORTD_SEG3_MASK                          equ 0008h
PORTD_SEG4_POSN                          equ 0004h
PORTD_SEG4_POSITION                      equ 0004h
PORTD_SEG4_SIZE                          equ 0001h
PORTD_SEG4_LENGTH                        equ 0001h
PORTD_SEG4_MASK                          equ 0010h
PORTD_SEG5_POSN                          equ 0005h
PORTD_SEG5_POSITION                      equ 0005h
PORTD_SEG5_SIZE                          equ 0001h
PORTD_SEG5_LENGTH                        equ 0001h
PORTD_SEG5_MASK                          equ 0020h
PORTD_SEG6_POSN                          equ 0006h
PORTD_SEG6_POSITION                      equ 0006h
PORTD_SEG6_SIZE                          equ 0001h
PORTD_SEG6_LENGTH                        equ 0001h
PORTD_SEG6_MASK                          equ 0040h
PORTD_SEG7_POSN                          equ 0007h
PORTD_SEG7_POSITION                      equ 0007h
PORTD_SEG7_SIZE                          equ 0001h
PORTD_SEG7_LENGTH                        equ 0001h
PORTD_SEG7_MASK                          equ 0080h
PORTD_P2D_POSN                           equ 0000h
PORTD_P2D_POSITION                       equ 0000h
PORTD_P2D_SIZE                           equ 0001h
PORTD_P2D_LENGTH                         equ 0001h
PORTD_P2D_MASK                           equ 0001h
PORTD_P2C_POSN                           equ 0001h
PORTD_P2C_POSITION                       equ 0001h
PORTD_P2C_SIZE                           equ 0001h
PORTD_P2C_LENGTH                         equ 0001h
PORTD_P2C_MASK                           equ 0002h
PORTD_P2B_POSN                           equ 0002h
PORTD_P2B_POSITION                       equ 0002h
PORTD_P2B_SIZE                           equ 0001h
PORTD_P2B_LENGTH                         equ 0001h
PORTD_P2B_MASK                           equ 0004h
PORTD_P3C_POSN                           equ 0003h
PORTD_P3C_POSITION                       equ 0003h
PORTD_P3C_SIZE                           equ 0001h
PORTD_P3C_LENGTH                         equ 0001h
PORTD_P3C_MASK                           equ 0008h
PORTD_P3B_POSN                           equ 0004h
PORTD_P3B_POSITION                       equ 0004h
PORTD_P3B_SIZE                           equ 0001h
PORTD_P3B_LENGTH                         equ 0001h
PORTD_P3B_MASK                           equ 0010h
PORTD_P1C_POSN                           equ 0005h
PORTD_P1C_POSITION                       equ 0005h
PORTD_P1C_SIZE                           equ 0001h
PORTD_P1C_LENGTH                         equ 0001h
PORTD_P1C_MASK                           equ 0020h
PORTD_P1B_POSN                           equ 0006h
PORTD_P1B_POSITION                       equ 0006h
PORTD_P1B_SIZE                           equ 0001h
PORTD_P1B_LENGTH                         equ 0001h
PORTD_P1B_MASK                           equ 0040h
PORTD_SDO2_POSN                          equ 0004h
PORTD_SDO2_POSITION                      equ 0004h
PORTD_SDO2_SIZE                          equ 0001h
PORTD_SDO2_LENGTH                        equ 0001h
PORTD_SDO2_MASK                          equ 0010h
PORTD_SDI2_POSN                          equ 0005h
PORTD_SDI2_POSITION                      equ 0005h
PORTD_SDI2_SIZE                          equ 0001h
PORTD_SDI2_LENGTH                        equ 0001h
PORTD_SDI2_MASK                          equ 0020h
PORTD_SCK2_POSN                          equ 0006h
PORTD_SCK2_POSITION                      equ 0006h
PORTD_SCK2_SIZE                          equ 0001h
PORTD_SCK2_LENGTH                        equ 0001h
PORTD_SCK2_MASK                          equ 0040h
PORTD_nSS2_POSN                          equ 0007h
PORTD_nSS2_POSITION                      equ 0007h
PORTD_nSS2_SIZE                          equ 0001h
PORTD_nSS2_LENGTH                        equ 0001h
PORTD_nSS2_MASK                          equ 0080h
PORTD_SDA2_POSN                          equ 0005h
PORTD_SDA2_POSITION                      equ 0005h
PORTD_SDA2_SIZE                          equ 0001h
PORTD_SDA2_LENGTH                        equ 0001h
PORTD_SDA2_MASK                          equ 0020h
PORTD_SCL2_POSN                          equ 0006h
PORTD_SCL2_POSITION                      equ 0006h
PORTD_SCL2_SIZE                          equ 0001h
PORTD_SCL2_LENGTH                        equ 0001h
PORTD_SCL2_MASK                          equ 0040h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0010h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h
PORTE_RE4_POSN                           equ 0004h
PORTE_RE4_POSITION                       equ 0004h
PORTE_RE4_SIZE                           equ 0001h
PORTE_RE4_LENGTH                         equ 0001h
PORTE_RE4_MASK                           equ 0010h
PORTE_RE5_POSN                           equ 0005h
PORTE_RE5_POSITION                       equ 0005h
PORTE_RE5_SIZE                           equ 0001h
PORTE_RE5_LENGTH                         equ 0001h
PORTE_RE5_MASK                           equ 0020h
PORTE_RE6_POSN                           equ 0006h
PORTE_RE6_POSITION                       equ 0006h
PORTE_RE6_SIZE                           equ 0001h
PORTE_RE6_LENGTH                         equ 0001h
PORTE_RE6_MASK                           equ 0040h
PORTE_RE7_POSN                           equ 0007h
PORTE_RE7_POSITION                       equ 0007h
PORTE_RE7_SIZE                           equ 0001h
PORTE_RE7_LENGTH                         equ 0001h
PORTE_RE7_MASK                           equ 0080h
PORTE_VLCD1_POSN                         equ 0000h
PORTE_VLCD1_POSITION                     equ 0000h
PORTE_VLCD1_SIZE                         equ 0001h
PORTE_VLCD1_LENGTH                       equ 0001h
PORTE_VLCD1_MASK                         equ 0001h
PORTE_VLCD2_POSN                         equ 0001h
PORTE_VLCD2_POSITION                     equ 0001h
PORTE_VLCD2_SIZE                         equ 0001h
PORTE_VLCD2_LENGTH                       equ 0001h
PORTE_VLCD2_MASK                         equ 0002h
PORTE_VLCD3_POSN                         equ 0002h
PORTE_VLCD3_POSITION                     equ 0002h
PORTE_VLCD3_SIZE                         equ 0001h
PORTE_VLCD3_LENGTH                       equ 0001h
PORTE_VLCD3_MASK                         equ 0004h
PORTE_COM0_POSN                          equ 0003h
PORTE_COM0_POSITION                      equ 0003h
PORTE_COM0_SIZE                          equ 0001h
PORTE_COM0_LENGTH                        equ 0001h
PORTE_COM0_MASK                          equ 0008h
PORTE_COM1_POSN                          equ 0004h
PORTE_COM1_POSITION                      equ 0004h
PORTE_COM1_SIZE                          equ 0001h
PORTE_COM1_LENGTH                        equ 0001h
PORTE_COM1_MASK                          equ 0010h
PORTE_COM2_POSN                          equ 0005h
PORTE_COM2_POSITION                      equ 0005h
PORTE_COM2_SIZE                          equ 0001h
PORTE_COM2_LENGTH                        equ 0001h
PORTE_COM2_MASK                          equ 0020h
PORTE_COM3_POSN                          equ 0006h
PORTE_COM3_POSITION                      equ 0006h
PORTE_COM3_SIZE                          equ 0001h
PORTE_COM3_LENGTH                        equ 0001h
PORTE_COM3_MASK                          equ 0040h
PORTE_SEG31_POSN                         equ 0007h
PORTE_SEG31_POSITION                     equ 0007h
PORTE_SEG31_SIZE                         equ 0001h
PORTE_SEG31_LENGTH                       equ 0001h
PORTE_SEG31_MASK                         equ 0080h
PORTE_P2D_POSN                           equ 0000h
PORTE_P2D_POSITION                       equ 0000h
PORTE_P2D_SIZE                           equ 0001h
PORTE_P2D_LENGTH                         equ 0001h
PORTE_P2D_MASK                           equ 0001h
PORTE_P2C_POSN                           equ 0001h
PORTE_P2C_POSITION                       equ 0001h
PORTE_P2C_SIZE                           equ 0001h
PORTE_P2C_LENGTH                         equ 0001h
PORTE_P2C_MASK                           equ 0002h
PORTE_P2B_POSN                           equ 0002h
PORTE_P2B_POSITION                       equ 0002h
PORTE_P2B_SIZE                           equ 0001h
PORTE_P2B_LENGTH                         equ 0001h
PORTE_P2B_MASK                           equ 0004h
PORTE_P3C_POSN                           equ 0003h
PORTE_P3C_POSITION                       equ 0003h
PORTE_P3C_SIZE                           equ 0001h
PORTE_P3C_LENGTH                         equ 0001h
PORTE_P3C_MASK                           equ 0008h
PORTE_P3B_POSN                           equ 0004h
PORTE_P3B_POSITION                       equ 0004h
PORTE_P3B_SIZE                           equ 0001h
PORTE_P3B_LENGTH                         equ 0001h
PORTE_P3B_MASK                           equ 0010h
PORTE_P1C_POSN                           equ 0005h
PORTE_P1C_POSITION                       equ 0005h
PORTE_P1C_SIZE                           equ 0001h
PORTE_P1C_LENGTH                         equ 0001h
PORTE_P1C_MASK                           equ 0020h
PORTE_P1B_POSN                           equ 0006h
PORTE_P1B_POSITION                       equ 0006h
PORTE_P1B_SIZE                           equ 0001h
PORTE_P1B_LENGTH                         equ 0001h
PORTE_P1B_MASK                           equ 0040h
PORTE_P2A_POSN                           equ 0007h
PORTE_P2A_POSITION                       equ 0007h
PORTE_P2A_SIZE                           equ 0001h
PORTE_P2A_LENGTH                         equ 0001h
PORTE_P2A_MASK                           equ 0080h
PORTE_CCP2_POSN                          equ 0007h
PORTE_CCP2_POSITION                      equ 0007h
PORTE_CCP2_SIZE                          equ 0001h
PORTE_CCP2_LENGTH                        equ 0001h
PORTE_CCP2_MASK                          equ 0080h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 0011h
// bitfield definitions
PIR1_TMR1IF_POSN                         equ 0000h
PIR1_TMR1IF_POSITION                     equ 0000h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0001h
PIR1_TMR2IF_POSN                         equ 0001h
PIR1_TMR2IF_POSITION                     equ 0001h
PIR1_TMR2IF_SIZE                         equ 0001h
PIR1_TMR2IF_LENGTH                       equ 0001h
PIR1_TMR2IF_MASK                         equ 0002h
PIR1_CCP1IF_POSN                         equ 0002h
PIR1_CCP1IF_POSITION                     equ 0002h
PIR1_CCP1IF_SIZE                         equ 0001h
PIR1_CCP1IF_LENGTH                       equ 0001h
PIR1_CCP1IF_MASK                         equ 0004h
PIR1_SSP1IF_POSN                         equ 0003h
PIR1_SSP1IF_POSITION                     equ 0003h
PIR1_SSP1IF_SIZE                         equ 0001h
PIR1_SSP1IF_LENGTH                       equ 0001h
PIR1_SSP1IF_MASK                         equ 0008h
PIR1_TX1IF_POSN                          equ 0004h
PIR1_TX1IF_POSITION                      equ 0004h
PIR1_TX1IF_SIZE                          equ 0001h
PIR1_TX1IF_LENGTH                        equ 0001h
PIR1_TX1IF_MASK                          equ 0010h
PIR1_RC1IF_POSN                          equ 0005h
PIR1_RC1IF_POSITION                      equ 0005h
PIR1_RC1IF_SIZE                          equ 0001h
PIR1_RC1IF_LENGTH                        equ 0001h
PIR1_RC1IF_MASK                          equ 0020h
PIR1_ADIF_POSN                           equ 0006h
PIR1_ADIF_POSITION                       equ 0006h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0040h
PIR1_TMR1GIF_POSN                        equ 0007h
PIR1_TMR1GIF_POSITION                    equ 0007h
PIR1_TMR1GIF_SIZE                        equ 0001h
PIR1_TMR1GIF_LENGTH                      equ 0001h
PIR1_TMR1GIF_MASK                        equ 0080h
PIR1_SSPIF_POSN                          equ 0003h
PIR1_SSPIF_POSITION                      equ 0003h
PIR1_SSPIF_SIZE                          equ 0001h
PIR1_SSPIF_LENGTH                        equ 0001h
PIR1_SSPIF_MASK                          equ 0008h
PIR1_TXIF_POSN                           equ 0004h
PIR1_TXIF_POSITION                       equ 0004h
PIR1_TXIF_SIZE                           equ 0001h
PIR1_TXIF_LENGTH                         equ 0001h
PIR1_TXIF_MASK                           equ 0010h
PIR1_RCIF_POSN                           equ 0005h
PIR1_RCIF_POSITION                       equ 0005h
PIR1_RCIF_SIZE                           equ 0001h
PIR1_RCIF_LENGTH                         equ 0001h
PIR1_RCIF_MASK                           equ 0020h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0012h
// bitfield definitions
PIR2_CCP2IF_POSN                         equ 0000h
PIR2_CCP2IF_POSITION                     equ 0000h
PIR2_CCP2IF_SIZE                         equ 0001h
PIR2_CCP2IF_LENGTH                       equ 0001h
PIR2_CCP2IF_MASK                         equ 0001h
PIR2_C3IF_POSN                           equ 0001h
PIR2_C3IF_POSITION                       equ 0001h
PIR2_C3IF_SIZE                           equ 0001h
PIR2_C3IF_LENGTH                         equ 0001h
PIR2_C3IF_MASK                           equ 0002h
PIR2_LCDIF_POSN                          equ 0002h
PIR2_LCDIF_POSITION                      equ 0002h
PIR2_LCDIF_SIZE                          equ 0001h
PIR2_LCDIF_LENGTH                        equ 0001h
PIR2_LCDIF_MASK                          equ 0004h
PIR2_BCLIF_POSN                          equ 0003h
PIR2_BCLIF_POSITION                      equ 0003h
PIR2_BCLIF_SIZE                          equ 0001h
PIR2_BCLIF_LENGTH                        equ 0001h
PIR2_BCLIF_MASK                          equ 0008h
PIR2_EEIF_POSN                           equ 0004h
PIR2_EEIF_POSITION                       equ 0004h
PIR2_EEIF_SIZE                           equ 0001h
PIR2_EEIF_LENGTH                         equ 0001h
PIR2_EEIF_MASK                           equ 0010h
PIR2_C1IF_POSN                           equ 0005h
PIR2_C1IF_POSITION                       equ 0005h
PIR2_C1IF_SIZE                           equ 0001h
PIR2_C1IF_LENGTH                         equ 0001h
PIR2_C1IF_MASK                           equ 0020h
PIR2_C2IF_POSN                           equ 0006h
PIR2_C2IF_POSITION                       equ 0006h
PIR2_C2IF_SIZE                           equ 0001h
PIR2_C2IF_LENGTH                         equ 0001h
PIR2_C2IF_MASK                           equ 0040h
PIR2_OSFIF_POSN                          equ 0007h
PIR2_OSFIF_POSITION                      equ 0007h
PIR2_OSFIF_SIZE                          equ 0001h
PIR2_OSFIF_LENGTH                        equ 0001h
PIR2_OSFIF_MASK                          equ 0080h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 0013h
// bitfield definitions
PIR3_TMR4IF_POSN                         equ 0001h
PIR3_TMR4IF_POSITION                     equ 0001h
PIR3_TMR4IF_SIZE                         equ 0001h
PIR3_TMR4IF_LENGTH                       equ 0001h
PIR3_TMR4IF_MASK                         equ 0002h
PIR3_TMR6IF_POSN                         equ 0003h
PIR3_TMR6IF_POSITION                     equ 0003h
PIR3_TMR6IF_SIZE                         equ 0001h
PIR3_TMR6IF_LENGTH                       equ 0001h
PIR3_TMR6IF_MASK                         equ 0008h
PIR3_CCP3IF_POSN                         equ 0004h
PIR3_CCP3IF_POSITION                     equ 0004h
PIR3_CCP3IF_SIZE                         equ 0001h
PIR3_CCP3IF_LENGTH                       equ 0001h
PIR3_CCP3IF_MASK                         equ 0010h
PIR3_CCP4IF_POSN                         equ 0005h
PIR3_CCP4IF_POSITION                     equ 0005h
PIR3_CCP4IF_SIZE                         equ 0001h
PIR3_CCP4IF_LENGTH                       equ 0001h
PIR3_CCP4IF_MASK                         equ 0020h
PIR3_CCP5IF_POSN                         equ 0006h
PIR3_CCP5IF_POSITION                     equ 0006h
PIR3_CCP5IF_SIZE                         equ 0001h
PIR3_CCP5IF_LENGTH                       equ 0001h
PIR3_CCP5IF_MASK                         equ 0040h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0014h
// bitfield definitions
PIR4_SSP2IF_POSN                         equ 0000h
PIR4_SSP2IF_POSITION                     equ 0000h
PIR4_SSP2IF_SIZE                         equ 0001h
PIR4_SSP2IF_LENGTH                       equ 0001h
PIR4_SSP2IF_MASK                         equ 0001h
PIR4_BCL2IF_POSN                         equ 0001h
PIR4_BCL2IF_POSITION                     equ 0001h
PIR4_BCL2IF_SIZE                         equ 0001h
PIR4_BCL2IF_LENGTH                       equ 0001h
PIR4_BCL2IF_MASK                         equ 0002h
PIR4_TX2IF_POSN                          equ 0004h
PIR4_TX2IF_POSITION                      equ 0004h
PIR4_TX2IF_SIZE                          equ 0001h
PIR4_TX2IF_LENGTH                        equ 0001h
PIR4_TX2IF_MASK                          equ 0010h
PIR4_RC2IF_POSN                          equ 0005h
PIR4_RC2IF_POSITION                      equ 0005h
PIR4_RC2IF_SIZE                          equ 0001h
PIR4_RC2IF_LENGTH                        equ 0001h
PIR4_RC2IF_MASK                          equ 0020h

