GopalSaraf/Practicals/PSDL/include/proc/pic16f1946.inc
// Register: DACCON0
#define DACCON0 DACCON0
DACCON0                                  equ 0118h
// bitfield definitions
DACCON0_DACNSS_POSN                      equ 0000h
DACCON0_DACNSS_POSITION                  equ 0000h
DACCON0_DACNSS_SIZE                      equ 0001h
DACCON0_DACNSS_LENGTH                    equ 0001h
DACCON0_DACNSS_MASK                      equ 0001h
DACCON0_DACPSS0_POSN                     equ 0002h
DACCON0_DACPSS0_POSITION                 equ 0002h
DACCON0_DACPSS0_SIZE                     equ 0001h
DACCON0_DACPSS0_LENGTH                   equ 0001h
DACCON0_DACPSS0_MASK                     equ 0004h
DACCON0_DACPSS1_POSN                     equ 0003h
DACCON0_DACPSS1_POSITION                 equ 0003h
DACCON0_DACPSS1_SIZE                     equ 0001h
DACCON0_DACPSS1_LENGTH                   equ 0001h
DACCON0_DACPSS1_MASK                     equ 0008h
DACCON0_DACOE_POSN                       equ 0005h
DACCON0_DACOE_POSITION                   equ 0005h
DACCON0_DACOE_SIZE                       equ 0001h
DACCON0_DACOE_LENGTH                     equ 0001h
DACCON0_DACOE_MASK                       equ 0020h
DACCON0_DACLPS_POSN                      equ 0006h
DACCON0_DACLPS_POSITION                  equ 0006h
DACCON0_DACLPS_SIZE                      equ 0001h
DACCON0_DACLPS_LENGTH                    equ 0001h
DACCON0_DACLPS_MASK                      equ 0040h
DACCON0_DACEN_POSN                       equ 0007h
DACCON0_DACEN_POSITION                   equ 0007h
DACCON0_DACEN_SIZE                       equ 0001h
DACCON0_DACEN_LENGTH                     equ 0001h
DACCON0_DACEN_MASK                       equ 0080h
DACCON0_DACPSS_POSN                      equ 0002h
DACCON0_DACPSS_POSITION                  equ 0002h
DACCON0_DACPSS_SIZE                      equ 0002h
DACCON0_DACPSS_LENGTH                    equ 0002h
DACCON0_DACPSS_MASK                      equ 000Ch

// Register: DACCON1
#define DACCON1 DACCON1
DACCON1                                  equ 0119h
// bitfield definitions
DACCON1_DACR0_POSN                       equ 0000h
DACCON1_DACR0_POSITION                   equ 0000h
DACCON1_DACR0_SIZE                       equ 0001h
DACCON1_DACR0_LENGTH                     equ 0001h
DACCON1_DACR0_MASK                       equ 0001h
DACCON1_DACR1_POSN                       equ 0001h
DACCON1_DACR1_POSITION                   equ 0001h
DACCON1_DACR1_SIZE                       equ 0001h
DACCON1_DACR1_LENGTH                     equ 0001h
DACCON1_DACR1_MASK                       equ 0002h
DACCON1_DACR2_POSN                       equ 0002h
DACCON1_DACR2_POSITION                   equ 0002h
DACCON1_DACR2_SIZE                       equ 0001h
DACCON1_DACR2_LENGTH                     equ 0001h
DACCON1_DACR2_MASK                       equ 0004h
DACCON1_DACR3_POSN                       equ 0003h
DACCON1_DACR3_POSITION                   equ 0003h
DACCON1_DACR3_SIZE                       equ 0001h
DACCON1_DACR3_LENGTH                     equ 0001h
DACCON1_DACR3_MASK                       equ 0008h
DACCON1_DACR4_POSN                       equ 0004h
DACCON1_DACR4_POSITION                   equ 0004h
DACCON1_DACR4_SIZE                       equ 0001h
DACCON1_DACR4_LENGTH                     equ 0001h
DACCON1_DACR4_MASK                       equ 0010h
DACCON1_DACR_POSN                        equ 0000h
DACCON1_DACR_POSITION                    equ 0000h
DACCON1_DACR_SIZE                        equ 0005h
DACCON1_DACR_LENGTH                      equ 0005h
DACCON1_DACR_MASK                        equ 001Fh

// Register: SRCON0
#define SRCON0 SRCON0
SRCON0                                   equ 011Ah
// bitfield definitions
SRCON0_SRPR_POSN                         equ 0000h
SRCON0_SRPR_POSITION                     equ 0000h
SRCON0_SRPR_SIZE                         equ 0001h
SRCON0_SRPR_LENGTH                       equ 0001h
SRCON0_SRPR_MASK                         equ 0001h
SRCON0_SRPS_POSN                         equ 0001h
SRCON0_SRPS_POSITION                     equ 0001h
SRCON0_SRPS_SIZE                         equ 0001h
SRCON0_SRPS_LENGTH                       equ 0001h
SRCON0_SRPS_MASK                         equ 0002h
SRCON0_SRNQEN_POSN                       equ 0002h
SRCON0_SRNQEN_POSITION                   equ 0002h
SRCON0_SRNQEN_SIZE                       equ 0001h
SRCON0_SRNQEN_LENGTH                     equ 0001h
SRCON0_SRNQEN_MASK                       equ 0004h
SRCON0_SRQEN_POSN                        equ 0003h
SRCON0_SRQEN_POSITION                    equ 0003h
SRCON0_SRQEN_SIZE                        equ 0001h
SRCON0_SRQEN_LENGTH                      equ 0001h
SRCON0_SRQEN_MASK                        equ 0008h
SRCON0_SRCLK0_POSN                       equ 0004h
SRCON0_SRCLK0_POSITION                   equ 0004h
SRCON0_SRCLK0_SIZE                       equ 0001h
SRCON0_SRCLK0_LENGTH                     equ 0001h
SRCON0_SRCLK0_MASK                       equ 0010h
SRCON0_SRCLK1_POSN                       equ 0005h
SRCON0_SRCLK1_POSITION                   equ 0005h
SRCON0_SRCLK1_SIZE                       equ 0001h
SRCON0_SRCLK1_LENGTH                     equ 0001h
SRCON0_SRCLK1_MASK                       equ 0020h
SRCON0_SRCLK2_POSN                       equ 0006h
SRCON0_SRCLK2_POSITION                   equ 0006h
SRCON0_SRCLK2_SIZE                       equ 0001h
SRCON0_SRCLK2_LENGTH                     equ 0001h
SRCON0_SRCLK2_MASK                       equ 0040h
SRCON0_SRLEN_POSN                        equ 0007h
SRCON0_SRLEN_POSITION                    equ 0007h
SRCON0_SRLEN_SIZE                        equ 0001h
SRCON0_SRLEN_LENGTH                      equ 0001h
SRCON0_SRLEN_MASK                        equ 0080h
SRCON0_SRCLK_POSN                        equ 0004h
SRCON0_SRCLK_POSITION                    equ 0004h
SRCON0_SRCLK_SIZE                        equ 0003h
SRCON0_SRCLK_LENGTH                      equ 0003h
SRCON0_SRCLK_MASK                        equ 0070h

// Register: SRCON1
#define SRCON1 SRCON1
SRCON1                                   equ 011Bh
// bitfield definitions
SRCON1_SRRC1E_POSN                       equ 0000h
SRCON1_SRRC1E_POSITION                   equ 0000h
SRCON1_SRRC1E_SIZE                       equ 0001h
SRCON1_SRRC1E_LENGTH                     equ 0001h
SRCON1_SRRC1E_MASK                       equ 0001h
SRCON1_SRRC2E_POSN                       equ 0001h
SRCON1_SRRC2E_POSITION                   equ 0001h
SRCON1_SRRC2E_SIZE                       equ 0001h
SRCON1_SRRC2E_LENGTH                     equ 0001h
SRCON1_SRRC2E_MASK                       equ 0002h
SRCON1_SRRCKE_POSN                       equ 0002h
SRCON1_SRRCKE_POSITION                   equ 0002h
SRCON1_SRRCKE_SIZE                       equ 0001h
SRCON1_SRRCKE_LENGTH                     equ 0001h
SRCON1_SRRCKE_MASK                       equ 0004h
SRCON1_SRRPE_POSN                        equ 0003h
SRCON1_SRRPE_POSITION                    equ 0003h
SRCON1_SRRPE_SIZE                        equ 0001h
SRCON1_SRRPE_LENGTH                      equ 0001h
SRCON1_SRRPE_MASK                        equ 0008h
SRCON1_SRSC1E_POSN                       equ 0004h
SRCON1_SRSC1E_POSITION                   equ 0004h
SRCON1_SRSC1E_SIZE                       equ 0001h
SRCON1_SRSC1E_LENGTH                     equ 0001h
SRCON1_SRSC1E_MASK                       equ 0010h
SRCON1_SRSC2E_POSN                       equ 0005h
SRCON1_SRSC2E_POSITION                   equ 0005h
SRCON1_SRSC2E_SIZE                       equ 0001h
SRCON1_SRSC2E_LENGTH                     equ 0001h
SRCON1_SRSC2E_MASK                       equ 0020h
SRCON1_SRSCKE_POSN                       equ 0006h
SRCON1_SRSCKE_POSITION                   equ 0006h
SRCON1_SRSCKE_SIZE                       equ 0001h
SRCON1_SRSCKE_LENGTH                     equ 0001h
SRCON1_SRSCKE_MASK                       equ 0040h
SRCON1_SRSPE_POSN                        equ 0007h
SRCON1_SRSPE_POSITION                    equ 0007h
SRCON1_SRSPE_SIZE                        equ 0001h
SRCON1_SRSPE_LENGTH                      equ 0001h
SRCON1_SRSPE_MASK                        equ 0080h

// Register: APFCON
#define APFCON APFCON
APFCON                                   equ 011Dh
// bitfield definitions
APFCON_P1BSEL_POSN                       equ 0000h
APFCON_P1BSEL_POSITION                   equ 0000h
APFCON_P1BSEL_SIZE                       equ 0001h
APFCON_P1BSEL_LENGTH                     equ 0001h
APFCON_P1BSEL_MASK                       equ 0001h
APFCON_P1CSEL_POSN                       equ 0001h
APFCON_P1CSEL_POSITION                   equ 0001h
APFCON_P1CSEL_SIZE                       equ 0001h
APFCON_P1CSEL_LENGTH                     equ 0001h
APFCON_P1CSEL_MASK                       equ 0002h
APFCON_CCP2SEL_POSN                      equ 0002h
APFCON_CCP2SEL_POSITION                  equ 0002h
APFCON_CCP2SEL_SIZE                      equ 0001h
APFCON_CCP2SEL_LENGTH                    equ 0001h
APFCON_CCP2SEL_MASK                      equ 0004h
APFCON_P2BSEL_POSN                       equ 0003h
APFCON_P2BSEL_POSITION                   equ 0003h
APFCON_P2BSEL_SIZE                       equ 0001h
APFCON_P2BSEL_LENGTH                     equ 0001h
APFCON_P2BSEL_MASK                       equ 0008h
APFCON_P2CSEL_POSN                       equ 0004h
APFCON_P2CSEL_POSITION                   equ 0004h
APFCON_P2CSEL_SIZE                       equ 0001h
APFCON_P2CSEL_LENGTH                     equ 0001h
APFCON_P2CSEL_MASK                       equ 0010h
APFCON_P2DSEL_POSN                       equ 0005h
APFCON_P2DSEL_POSITION                   equ 0005h
APFCON_P2DSEL_SIZE                       equ 0001h
APFCON_P2DSEL_LENGTH                     equ 0001h
APFCON_P2DSEL_MASK                       equ 0020h
APFCON_P3BSEL_POSN                       equ 0006h
APFCON_P3BSEL_POSITION                   equ 0006h
APFCON_P3BSEL_SIZE                       equ 0001h
APFCON_P3BSEL_LENGTH                     equ 0001h
APFCON_P3BSEL_MASK                       equ 0040h
APFCON_P3CSEL_POSN                       equ 0007h
APFCON_P3CSEL_POSITION                   equ 0007h
APFCON_P3CSEL_SIZE                       equ 0001h
APFCON_P3CSEL_LENGTH                     equ 0001h
APFCON_P3CSEL_MASK                       equ 0080h

// Register: CM3CON0
#define CM3CON0 CM3CON0
CM3CON0                                  equ 011Eh
// bitfield definitions
CM3CON0_C3SYNC_POSN                      equ 0000h
CM3CON0_C3SYNC_POSITION                  equ 0000h
CM3CON0_C3SYNC_SIZE                      equ 0001h
CM3CON0_C3SYNC_LENGTH                    equ 0001h
CM3CON0_C3SYNC_MASK                      equ 0001h
CM3CON0_C3HYS_POSN                       equ 0001h
CM3CON0_C3HYS_POSITION                   equ 0001h
CM3CON0_C3HYS_SIZE                       equ 0001h
CM3CON0_C3HYS_LENGTH                     equ 0001h
CM3CON0_C3HYS_MASK                       equ 0002h
CM3CON0_C3SP_POSN                        equ 0002h
CM3CON0_C3SP_POSITION                    equ 0002h
CM3CON0_C3SP_SIZE                        equ 0001h
CM3CON0_C3SP_LENGTH                      equ 0001h
CM3CON0_C3SP_MASK                        equ 0004h
CM3CON0_C3POL_POSN                       equ 0004h
CM3CON0_C3POL_POSITION                   equ 0004h
CM3CON0_C3POL_SIZE                       equ 0001h
CM3CON0_C3POL_LENGTH                     equ 0001h
CM3CON0_C3POL_MASK                       equ 0010h
CM3CON0_C3OE_POSN                        equ 0005h
CM3CON0_C3OE_POSITION                    equ 0005h
CM3CON0_C3OE_SIZE                        equ 0001h
CM3CON0_C3OE_LENGTH                      equ 0001h
CM3CON0_C3OE_MASK                        equ 0020h
CM3CON0_C3OUT_POSN                       equ 0006h
CM3CON0_C3OUT_POSITION                   equ 0006h
CM3CON0_C3OUT_SIZE                       equ 0001h
CM3CON0_C3OUT_LENGTH                     equ 0001h
CM3CON0_C3OUT_MASK                       equ 0040h
CM3CON0_C3ON_POSN                        equ 0007h
CM3CON0_C3ON_POSITION                    equ 0007h
CM3CON0_C3ON_SIZE                        equ 0001h
CM3CON0_C3ON_LENGTH                      equ 0001h
CM3CON0_C3ON_MASK                        equ 0080h

// Register: CM3CON1
#define CM3CON1 CM3CON1
CM3CON1                                  equ 011Fh
// bitfield definitions
CM3CON1_C3NCH0_POSN                      equ 0000h
CM3CON1_C3NCH0_POSITION                  equ 0000h
CM3CON1_C3NCH0_SIZE                      equ 0001h
CM3CON1_C3NCH0_LENGTH                    equ 0001h
CM3CON1_C3NCH0_MASK                      equ 0001h
CM3CON1_C3NCH1_POSN                      equ 0001h
CM3CON1_C3NCH1_POSITION                  equ 0001h
CM3CON1_C3NCH1_SIZE                      equ 0001h
CM3CON1_C3NCH1_LENGTH                    equ 0001h
CM3CON1_C3NCH1_MASK                      equ 0002h
CM3CON1_C3PCH0_POSN                      equ 0004h
CM3CON1_C3PCH0_POSITION                  equ 0004h
CM3CON1_C3PCH0_SIZE                      equ 0001h
CM3CON1_C3PCH0_LENGTH                    equ 0001h
CM3CON1_C3PCH0_MASK                      equ 0010h
CM3CON1_C3PCH1_POSN                      equ 0005h
CM3CON1_C3PCH1_POSITION                  equ 0005h
CM3CON1_C3PCH1_SIZE                      equ 0001h
CM3CON1_C3PCH1_LENGTH                    equ 0001h
CM3CON1_C3PCH1_MASK                      equ 0020h
CM3CON1_C3INTN_POSN                      equ 0006h
CM3CON1_C3INTN_POSITION                  equ 0006h
CM3CON1_C3INTN_SIZE                      equ 0001h
CM3CON1_C3INTN_LENGTH                    equ 0001h
CM3CON1_C3INTN_MASK                      equ 0040h
CM3CON1_C3INTP_POSN                      equ 0007h
CM3CON1_C3INTP_POSITION                  equ 0007h
CM3CON1_C3INTP_SIZE                      equ 0001h
CM3CON1_C3INTP_LENGTH                    equ 0001h
CM3CON1_C3INTP_MASK                      equ 0080h
CM3CON1_C3NCH_POSN                       equ 0000h
CM3CON1_C3NCH_POSITION                   equ 0000h
CM3CON1_C3NCH_SIZE                       equ 0002h
CM3CON1_C3NCH_LENGTH                     equ 0002h
CM3CON1_C3NCH_MASK                       equ 0003h
CM3CON1_C3PCH_POSN                       equ 0004h
CM3CON1_C3PCH_POSITION                   equ 0004h
CM3CON1_C3PCH_SIZE                       equ 0002h
CM3CON1_C3PCH_LENGTH                     equ 0002h
CM3CON1_C3PCH_MASK                       equ 0030h

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 018Ch
// bitfield definitions
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA3_POSN                        equ 0003h
ANSELA_ANSA3_POSITION                    equ 0003h
ANSELA_ANSA3_SIZE                        equ 0001h
ANSELA_ANSA3_LENGTH                      equ 0001h
ANSELA_ANSA3_MASK                        equ 0008h
ANSELA_ANSA5_POSN                        equ 0005h
ANSELA_ANSA5_POSITION                    equ 0005h
ANSELA_ANSA5_SIZE                        equ 0001h
ANSELA_ANSA5_LENGTH                      equ 0001h
ANSELA_ANSA5_MASK                        equ 0020h
ANSELA_ANSELA_POSN                       equ 0000h
ANSELA_ANSELA_POSITION                   equ 0000h
ANSELA_ANSELA_SIZE                       equ 0006h
ANSELA_ANSELA_LENGTH                     equ 0006h
ANSELA_ANSELA_MASK                       equ 003Fh

