GopalSaraf/Practicals/PSDL/include/proc/pic16f1946.inc
#define SEG5                             BANKMASK(PORTD), 5
#define SEG5COM0                         BANKMASK(LCDDATA0), 5
#define SEG5COM1                         BANKMASK(LCDDATA3), 5
#define SEG5COM2                         BANKMASK(LCDDATA6), 5
#define SEG5COM3                         BANKMASK(LCDDATA9), 5
#define SEG6                             BANKMASK(PORTD), 6
#define SEG6COM0                         BANKMASK(LCDDATA0), 6
#define SEG6COM1                         BANKMASK(LCDDATA3), 6
#define SEG6COM2                         BANKMASK(LCDDATA6), 6
#define SEG6COM3                         BANKMASK(LCDDATA9), 6
#define SEG7                             BANKMASK(PORTD), 7
#define SEG7COM0                         BANKMASK(LCDDATA0), 7
#define SEG7COM1                         BANKMASK(LCDDATA3), 7
#define SEG7COM2                         BANKMASK(LCDDATA6), 7
#define SEG7COM3                         BANKMASK(LCDDATA9), 7
#define SEG8                             BANKMASK(PORTB), 1
#define SEG8COM0                         BANKMASK(LCDDATA1), 0
#define SEG8COM1                         BANKMASK(LCDDATA4), 0
#define SEG8COM2                         BANKMASK(LCDDATA7), 0
#define SEG8COM3                         BANKMASK(LCDDATA10), 0
#define SEG9                             BANKMASK(PORTB), 2
#define SEG9COM0                         BANKMASK(LCDDATA1), 1
#define SEG9COM1                         BANKMASK(LCDDATA4), 1
#define SEG9COM2                         BANKMASK(LCDDATA7), 1
#define SEG9COM3                         BANKMASK(LCDDATA10), 1
#define SLPEN                            BANKMASK(LCDCON), 6
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SRCLK0                           BANKMASK(SRCON0), 4
#define SRCLK1                           BANKMASK(SRCON0), 5
#define SRCLK2                           BANKMASK(SRCON0), 6
#define SRI                              BANKMASK(PORTB), 0
#define SRLEN                            BANKMASK(SRCON0), 7
#define SRNQ                             BANKMASK(PORTF), 1
#define SRNQEN                           BANKMASK(SRCON0), 2
#define SRPR                             BANKMASK(SRCON0), 0
#define SRPS                             BANKMASK(SRCON0), 1
#define SRQ                              BANKMASK(PORTF), 2
#define SRQEN                            BANKMASK(SRCON0), 3
#define SRRC1E                           BANKMASK(SRCON1), 0
#define SRRC2E                           BANKMASK(SRCON1), 1
#define SRRCKE                           BANKMASK(SRCON1), 2
#define SRRPE                            BANKMASK(SRCON1), 3
#define SRSC1E                           BANKMASK(SRCON1), 4
#define SRSC2E                           BANKMASK(SRCON1), 5
#define SRSCKE                           BANKMASK(SRCON1), 6
#define SRSPE                            BANKMASK(SRCON1), 7
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP2IE                           BANKMASK(PIE4), 0
#define SSP2IF                           BANKMASK(PIR4), 0
#define SSPIE                            BANKMASK(PIE1), 3
#define SSPIF                            BANKMASK(PIR1), 3
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define STR1A                            BANKMASK(PSTR1CON), 0
#define STR1B                            BANKMASK(PSTR1CON), 1
#define STR1C                            BANKMASK(PSTR1CON), 2
#define STR1D                            BANKMASK(PSTR1CON), 3
#define STR1SYNC                         BANKMASK(PSTR1CON), 4
#define STR2A                            BANKMASK(PSTR2CON), 0
#define STR2B                            BANKMASK(PSTR2CON), 1
#define STR2C                            BANKMASK(PSTR2CON), 2
#define STR2D                            BANKMASK(PSTR2CON), 3
#define STR2SYNC                         BANKMASK(PSTR2CON), 4
#define STR3A                            BANKMASK(PSTR3CON), 0
#define STR3B                            BANKMASK(PSTR3CON), 1
#define STR3C                            BANKMASK(PSTR3CON), 2
#define STR3D                            BANKMASK(PSTR3CON), 3
#define STR3SYNC                         BANKMASK(PSTR3CON), 4
#define SWDTEN                           BANKMASK(WDTCON), 0
#define T0CKI                            BANKMASK(PORTA), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T0XCS                            BANKMASK(CPSCON0), 0
#define T1CKI                            BANKMASK(PORTC), 0
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1G                              BANKMASK(PORTB), 5
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T1OSCR                           BANKMASK(OSCSTAT), 7
#define T1OSI                            BANKMASK(PORTC), 1
#define T1OSO                            BANKMASK(PORTC), 0
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define T2OUTPS0                         BANKMASK(T2CON), 3
#define T2OUTPS1                         BANKMASK(T2CON), 4
#define T2OUTPS2                         BANKMASK(T2CON), 5
#define T2OUTPS3                         BANKMASK(T2CON), 6
#define T4CKPS0                          BANKMASK(T4CON), 0
#define T4CKPS1                          BANKMASK(T4CON), 1
#define T4OUTPS0                         BANKMASK(T4CON), 3
#define T4OUTPS1                         BANKMASK(T4CON), 4
#define T4OUTPS2                         BANKMASK(T4CON), 5
#define T4OUTPS3                         BANKMASK(T4CON), 6
#define T6CKPS0                          BANKMASK(T6CON), 0
#define T6CKPS1                          BANKMASK(T6CON), 1
#define T6OUTPS0                         BANKMASK(T6CON), 3
#define T6OUTPS1                         BANKMASK(T6CON), 4
#define T6OUTPS2                         BANKMASK(T6CON), 5
#define T6OUTPS3                         BANKMASK(T6CON), 6
#define TMR0CS                           BANKMASK(OPTION_REG), 5
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR0SE                           BANKMASK(OPTION_REG), 4
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TMR4IE                           BANKMASK(PIE3), 1
#define TMR4IF                           BANKMASK(PIR3), 1
#define TMR4ON                           BANKMASK(T4CON), 2
#define TMR6IE                           BANKMASK(PIE3), 3
#define TMR6IF                           BANKMASK(PIR3), 3
#define TMR6ON                           BANKMASK(T6CON), 2
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISA6                           BANKMASK(TRISA), 6
#define TRISA7                           BANKMASK(TRISA), 7
#define TRISB0                           BANKMASK(TRISB), 0
#define TRISB1                           BANKMASK(TRISB), 1
#define TRISB2                           BANKMASK(TRISB), 2
#define TRISB3                           BANKMASK(TRISB), 3
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRISC6                           BANKMASK(TRISC), 6
#define TRISC7                           BANKMASK(TRISC), 7
#define TRISD0                           BANKMASK(TRISD), 0
#define TRISD1                           BANKMASK(TRISD), 1
#define TRISD2                           BANKMASK(TRISD), 2
#define TRISD3                           BANKMASK(TRISD), 3
#define TRISD4                           BANKMASK(TRISD), 4
#define TRISD5                           BANKMASK(TRISD), 5
#define TRISD6                           BANKMASK(TRISD), 6
#define TRISD7                           BANKMASK(TRISD), 7
#define TRISE0                           BANKMASK(TRISE), 0
#define TRISE1                           BANKMASK(TRISE), 1
#define TRISE2                           BANKMASK(TRISE), 2
#define TRISE3                           BANKMASK(TRISE), 3
#define TRISE4                           BANKMASK(TRISE), 4
#define TRISE5                           BANKMASK(TRISE), 5
#define TRISE6                           BANKMASK(TRISE), 6
#define TRISE7                           BANKMASK(TRISE), 7
#define TRISF0                           BANKMASK(TRISF), 0
#define TRISF1                           BANKMASK(TRISF), 1
#define TRISF2                           BANKMASK(TRISF), 2
#define TRISF3                           BANKMASK(TRISF), 3
#define TRISF4                           BANKMASK(TRISF), 4
#define TRISF5                           BANKMASK(TRISF), 5
#define TRISF6                           BANKMASK(TRISF), 6
#define TRISF7                           BANKMASK(TRISF), 7
#define TRISG0                           BANKMASK(TRISG), 0
#define TRISG1                           BANKMASK(TRISG), 1
#define TRISG2                           BANKMASK(TRISG), 2
#define TRISG3                           BANKMASK(TRISG), 3
#define TRISG4                           BANKMASK(TRISG), 4
#define TRISG5                           BANKMASK(TRISG), 5
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define TUN5                             BANKMASK(OSCTUNE), 5
#define TX1                              BANKMASK(PORTC), 6
#define TX1IE                            BANKMASK(PIE1), 4
#define TX1IF                            BANKMASK(PIR1), 4
#define TX2                              BANKMASK(PORTG), 1
#define TX2IE                            BANKMASK(PIE4), 4
#define TX2IF                            BANKMASK(PIR4), 4
#define TXIE                             BANKMASK(PIE1), 4
#define TXIF                             BANKMASK(PIR1), 4
#define VLCD1                            BANKMASK(PORTE), 0
#define VLCD1PE                          BANKMASK(LCDREF), 1
#define VLCD2                            BANKMASK(PORTE), 1
#define VLCD2PE                          BANKMASK(LCDREF), 2
#define VLCD3                            BANKMASK(PORTE), 2
#define VLCD3PE                          BANKMASK(LCDREF), 3
#define VREFM                            BANKMASK(PORTA), 2
#define VREFP                            BANKMASK(PORTA), 3
#define WA                               BANKMASK(LCDPS), 4
#define WDTPS0                           BANKMASK(WDTCON), 1
#define WDTPS1                           BANKMASK(WDTCON), 2
#define WDTPS2                           BANKMASK(WDTCON), 3
#define WDTPS3                           BANKMASK(WDTCON), 4
#define WDTPS4                           BANKMASK(WDTCON), 5
#define WERR                             BANKMASK(LCDCON), 5
#define WFT                              BANKMASK(LCDPS), 7
#define WPUB0                            BANKMASK(WPUB), 0
#define WPUB1                            BANKMASK(WPUB), 1
#define WPUB2                            BANKMASK(WPUB), 2
#define WPUB3                            BANKMASK(WPUB), 3
#define WPUB4                            BANKMASK(WPUB), 4
#define WPUB5                            BANKMASK(WPUB), 5
#define WPUB6                            BANKMASK(WPUB), 6
#define WPUB7                            BANKMASK(WPUB), 7
#define WPUG5                            BANKMASK(WPUG), 5
#define WR                               BANKMASK(EECON1), 1
#define WREN                             BANKMASK(EECON1), 2
#define WRERR                            BANKMASK(EECON1), 3
#define ZERO                             BANKMASK(STATUS), 2
#define Z_SHAD                           BANKMASK(STATUS_SHAD), 2
#define nBOR                             BANKMASK(PCON), 0
#define nDONE                            BANKMASK(ADCON0), 1
#define nMCLR                            BANKMASK(PORTG), 5
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nRI                              BANKMASK(PCON), 2
#define nRMCLR                           BANKMASK(PCON), 3
#define nSS2                             BANKMASK(PORTD), 7
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4
#define nWPUEN                           BANKMASK(OPTION_REG), 7

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16F1946_INC_
